tap "olets/tap"
brew "apr-util"
brew "chezmoi"
brew "glib"
brew "duti"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "httpd"
brew "libpq", link: true
brew "libslirp"
brew "mise"
brew "mysql-client"
brew "openjdk"
brew "pinentry-mac"
brew "qemu"
brew "olets/tap/zsh-abbr"
cask "codex"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-udev-gothic"
cask "gcloud-cli"
cask "ghostty"
cask "homerow"
cask "karabiner-elements"
cask "keepassxc"
cask "kiro"
cask "temurin@11"
cask "temurin@21"
cask "wireshark-app"
cask "zed"
