brew "apr-util"
brew "bat"
brew "glib"
brew "ccusage"
brew "cmake"
brew "deno"
brew "docker"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "go@1.24"
brew "golangci-lint"
brew "httpd"
brew "jq"
brew "k6"
brew "libpq", link: true
brew "libslirp"
brew "llvm"
brew "mise"
brew "mycli"
brew "mysql-client"
brew "neovim"
brew "ninja"
brew "openjdk"
brew "pgcli"
brew "pinentry-mac"
brew "pnpm"
brew "pspg"
brew "qemu"
brew "ripgrep"
brew "sccache"
brew "sqlfluff"
brew "sqruff"
brew "telnet"
brew "tmux"
brew "tree"
brew "uv"
brew "yq"
cask "font-droid-sans-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-udev-gothic"
cask "gcloud-cli"
cask "ghostty"
cask "homerow"
cask "karabiner-elements"
cask "keepassxc"
cask "kiro"
cask "temurin@21"
cask "wireshark-app"
cask "zed"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hancel.markdown-image"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "teabyii.ayu"
vscode "vscode-icons-team.vscode-icons"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "golang.org/dl/go1.24.2"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/securego/gosec/v2/cmd/gosec"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
go "github.com/rubenv/sql-migrate/sql-migrate"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "github.com/sqls-server/sqls"
go "honnef.co/go/tools/cmd/staticcheck"
